
# BloodHound Queries for Tier Zero and Other Vulnerabilities

## Tier Zero Attack Paths

| Vulnerability | Command / Cypher Query |
| ------------- | ---------------------- |
| Incomplete Tier Zero Principal Segmentation within Organizational Units (OUs) | `MATCH (n:OU)-[:Contains]->(m:Computer) WHERE m.highvalue = true RETURN n, m` |
| Generic All Privileges on Tier Zero Objects | `MATCH (n)-[r:GenericAll]->(m) WHERE m.highvalue = true RETURN n, r, m` |
| Generic Write Privileges on Tier Zero Objects | `MATCH (n)-[r:GenericWrite]->(m) WHERE m.highvalue = true RETURN n, r, m` |
| Add Member Privileges on Tier Zero Security Groups | `MATCH (n)-[r:AddMember]->(m:Group) WHERE m.highvalue = true RETURN n, r, m` |
| Force Change Password Privileges on Tier Zero Objects | `MATCH (n)-[r:ForceChangePassword]->(m) WHERE m.highvalue = true RETURN n, r, m` |
| Write DACL Privileges on Tier Zero Objects | `MATCH (n)-[r:WriteDacl]->(m) WHERE m.highvalue = true RETURN n, r, m` |
| Read GMSA Password Privileges on Tier Zero Objects | `MATCH (n)-[r:ReadGMSAPassword]->(m) WHERE m.highvalue = true RETURN n, r, m` |
| Logons from Tier Zero Users | `MATCH (n:User)-[:HasSession]->(m:Computer) WHERE n.highvalue = true RETURN n, m` |
| RDP Users on Tier Zero Computers | `MATCH (n:User)-[:MemberOf]->(:Group {name: "RDP Users"})-[:AdminTo]->(m:Computer) WHERE m.highvalue = true RETURN n, m` |
| Ownership Privileges on Tier Zero Objects | `MATCH (n)-[r:Owner]->(m) WHERE m.highvalue = true RETURN n, r, m` |
| Resource-Based Constrained Delegation Privileges on Tier Zero Computers | `MATCH (n)-[r:HasDelegation]->(m:Computer) WHERE m.highvalue = true RETURN n, r, m` |
| Admins on Tier Zero Computers | `MATCH (n)-[:AdminTo]->(m:Computer) WHERE m.highvalue = true RETURN n, m` |
| Write Account Restrictions Privileges on Tier Zero Objects | `MATCH (n)-[r:WriteAccountRestrictions]->(m) WHERE m.highvalue = true RETURN n, r, m` |

## Least Privilege Enforcement

| Vulnerability | Command / Cypher Query |
| ------------- | ---------------------- |
| Accounts with clear-text password attributes | `MATCH (n)-[:HasPassword]->(m:User) WHERE n.admincount = 1 RETURN n, m` |
| Large Default Groups with Generic All Privileges | `MATCH (n)-[:MemberOf]->(g:Group)-[r:GenericAll]->(m) WHERE g.admincount = 1 RETURN n, r, m` |
| Large Default Groups with All Extended Privileges | `MATCH (n)-[:MemberOf]->(g:Group)-[r:AllExtendedRights]->(m) WHERE g.admincount = 1 RETURN n, r, m` |
| Large Default Groups with Generic Write Privileges | `MATCH (n)-[:MemberOf]->(g:Group)-[r:GenericWrite]->(m) WHERE g.admincount = 1 RETURN n, r, m` |
| Large Default Groups in Local Administrator Groups | `MATCH (n)-[:MemberOf]->(g:Group)-[:AdminTo]->(m:Computer) RETURN n, g, m` |
| Large Default Groups with Write Account Restrictions Privileges | `MATCH (n)-[:MemberOf]->(g:Group)-[r:WriteAccountRestrictions]->(m) RETURN n, r, m` |
| Large Default Groups with RDP Access | `MATCH (n)-[:MemberOf]->(g:Group)-[:AdminTo]->(m:Computer) WHERE g.name = "RDP Users" RETURN n, g, m` |
| Large Default Groups in DCOM Users Groups | `MATCH (n)-[:MemberOf]->(g:Group {name: "DCOM Users"}) RETURN n, g` |

## Abusable Kerberos Configurations

| Vulnerability | Command / Cypher Query |
| ------------- | ---------------------- |
| Generic Write Privileges on Computers Trusted for Unconstrained Delegation | `MATCH (n)-[r:GenericWrite]->(m:Computer) WHERE m.trusteddomain = true RETURN n, r, m` |
| Ownership Privileges on Computers Trusted for Unconstrained Delegation | `MATCH (n)-[r:Owner]->(m:Computer) WHERE m.trusteddomain = true RETURN n, r, m` |
| RDP Users on Computers Trusted for Unconstrained Delegation | `MATCH (n:User)-[:MemberOf]->(g:Group {name: "RDP Users"})-[:AdminTo]->(m:Computer) WHERE m.trusteddomain = true RETURN n, g, m` |
| Write Account Restrictions Privileges on Computers Trusted for Unconstrained Delegation | `MATCH (n)-[r:WriteAccountRestrictions]->(m:Computer) WHERE m.trusteddomain = true RETURN n, r, m` |
| Admins on Computers Trusted for Unconstrained Delegation | `MATCH (n)-[:AdminTo]->(m:Computer) WHERE m.trusteddomain = true RETURN n, m` |
| Generic All Privileges on Computers Trusted for Unconstrained Delegation | `MATCH (n)-[r:GenericAll]->(m:Computer) WHERE m.trusteddomain = true RETURN n, r, m` |

## Kerberos Delegation on Tier Zero Objects

| Vulnerability | Command / Cypher Query |
| ------------- | ---------------------- |
| Kerberoastable User Accounts | `MATCH (n:User) WHERE n.kerberoast = true RETURN n` |
| AS-REP Roastable User Accounts | `MATCH (n:User) WHERE n.dontreqpreauth = true RETURN n` |

## Tier Zero Hygiene

| Vulnerability | Command / Cypher Query |
| ------------- | ---------------------- |
| End of Support Tier Zero Operating System | `MATCH (n:Computer {os: "end-of-support"}) WHERE n.highvalue = true RETURN n` |
| Excessive Membership of Tier Zero Group | `MATCH (n:User)-[:MemberOf]->(g:Group) WHERE g.highvalue = true RETURN n, g` |
| Disabled Tier Zero Accounts | `MATCH (n:User) WHERE n.enabled = false AND n.highvalue = true RETURN n` |
| Inactive Tier Zero Accounts | `MATCH (n:User) WHERE n.lastlogon > 90 AND n.highvalue = true RETURN n` |
| KRBTGT Account Password not Rotated | `MATCH (n:User {name: "krbtgt"}) WHERE n.pwdlastset > 180 RETURN n` |
| Nested Group under a Tier Zero Default | `MATCH (n:Group)-[:MemberOf]->(m:Group) WHERE m.highvalue = true RETURN n, m` |
